var game = [
    {
        question: 'Кто живёт на Марсе?',
        answer1: 'Марсельцы',
        answer2: 'Марсиане',
        answer3: 'Марсоходы',
        answer4: 'Марсопоклонники',
        correct: 2
    },
    {
        question: 'Как называется треугольный пирожок в Казани?',
        answer1: 'Беляш',
        answer2: 'Элеш',
        answer3: 'Курник',
        answer4: 'Эчпочмак',
        correct: 4
    },
    {
        question: 'Как правильно закончить пословицу: «Не откладывай на завтра то, что можно…»?',
        answer1: 'сделать сегодня',
        answer2: 'сделать послезавтра',
        answer3: 'сделать через месяц',
        answer4: 'никогда не делать',
        correct: 1
    },
    {
        question: 'Что помогает туристу ориентироваться в незнакомом городе?',
        answer1: 'Путепровод',
        answer2: 'Путеукладчик',
        answer3: 'Путеводитель',
        answer4: 'Путеводная звезда',
        correct: 2
    },
    {
        question: 'Что такое лобогрейка?',
        answer1: 'Жнейка',
        answer2: 'Шапка',
        answer3: 'Болезнь',
        answer4: 'Печка',
        correct: 1
    },
];
