var game = [
    {
        question: 'Кто живёт на Марсе?\n',
        answer1: '1 - Марсельцы\n',
        answer2: '2 - Марсиане\n',
        answer3: '3 - Марсоходы\n',
        answer4: '4 - Марсопоклонники\n',
        correct: 2
    },
    {
        question: 'Как называется треугольный пирожок в Казани?\n',
        answer1: '1 - Беляш\n',
        answer2: '2 - Элеш\n',
        answer3: '3 - Курник\n',
        answer4: '4 - Эчпочмак\n',
        correct: 4
    },
    {
        question: 'Как правильно закончить пословицу: «Не откладывай на завтра то, что можно…»?\n',
        answer1: '1 - сделать сегодня\n',
        answer2: '2 - сделать послезавтра\n',
        answer3: '3 - сделать через месяц\n',
        answer4: '4 - никогда не делать\n',
        correct: 1
    },
    {
        question: 'Что помогает туристу ориентироваться в незнакомом городе?\n',
        answer1: '1 - Путепровод\n',
        answer2: '2 - Путеукладчик\n',
        answer3: '3 - Путеводитель\n',
        answer4: '4 - Путеводная звезда\n',
        correct: 2
    },
    {
        question: 'Что такое лобогрейка?\n',
        answer1: '1 - Жнейка\n',
        answer2: '2 - Шапка\n',
        answer3: '3 - Болезнь\n',
        answer4: '4 - Печка\n',
        correct: 1
    },
];
