var game = [
    {
        question: 'Кто живёт на Марсе?\n',
        answers: '1 - Марсельцы\n' +
            '2 - Марсиане\n' +
            '3 - Марсоходы\n' +
            '4 - Марсопоклонники\n',
        correct: 2,
        money: 100,
    },
    {
        question: 'Как называется треугольный пирожок в Казани?\n',
        answers: '1 - Беляш\n' +
            '2 - Элеш\n' +
            '3 - Курник\n' +
            '4 - Эчпочмак\n',
        correct: 4,
        money: 200,
    },
    {
        question: 'Как правильно закончить пословицу: «Не откладывай на завтра то, что можно…»?\n',
        answers: '1 - сделать сегодня\n' +
            '2 - сделать послезавтра\n' +
            '3 - сделать через месяц\n' +
            '4 - никогда не делать\n',
        correct: 1,
        money: 300,
    },
    {
        question: 'Что помогает туристу ориентироваться в незнакомом городе?\n',
        answers: '1 - Путепровод\n' +
            '2 - Путеукладчик\n' +
            '3 - Путеводитель\n' +
            '4 - Путеводная звезда\n',
        correct: 3,
        money: 500,
    },
    {
        question: 'Что такое лобогрейка?\n',
        answers: '1 - Жнейка\n' +
            '2 - Шапка\n' +
            '3 - Болезнь\n' +
            '4 - Печка\n',
        correct: 1,
        money: 1000,
    },
];
